In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
studs = pd.Series(['Bob', 'Mary', 'Joe', 'Will', 'Bob', 'Anne'], 
                         index = ['f', 'e', 'c', 'd', 'a', 'b'])

In [3]:
# Integer-location based indexing
studs.iloc[1:3] # or studs[1:3]

e    Mary
c     Joe
dtype: object

In [4]:
# Boolean indexing
studs.loc[studs == 'Bob'] # or studs[studs == 'Bob']

f    Bob
a    Bob
dtype: object

In [5]:
# Label indexing
studs.loc[['e', 'c', 'd']] # or studs[['e', 'c', d']]

e    Mary
c     Joe
d    Will
dtype: object

In [6]:
studs.loc['e':'d'] # or studs['e':'d']

e    Mary
c     Joe
d    Will
dtype: object

# DataFrame

## DataFrame construction

In [7]:
# Specify values for each column
df = pd.DataFrame({
        "CS101": [10, 5, 8],
        "CS102": [8, 7, 8],
        "CS103": [9, 10, 9],
        "CS104": [5, 7, 6]
    },
    index = ['Bob', 'Mary', 'Anne'])
df

      CS101  CS102  CS103  CS104
Bob      10      8      9      5
Mary      5      7     10      7
Anne      8      8      9      6

In [8]:
# Specify values for each row
data = [[10, 8, 9, 5], [5, 7, 10, 7], [8, 8, 9, 6]]
df = pd.DataFrame(data, 
                  index = ['Bob', 'Mary', 'Anne'], 
                  columns = ['CS101', 'CS102', 'CS103', 'CS104'])
df.index.name = 'Student'
df.columns.name = 'Course'
df

Course   CS101  CS102  CS103  CS104
Student
Bob         10      8      9      5
Mary         5      7     10      7
Anne         8      8      9      6

In [9]:
# Specify values for each row with Hierarchical Indexing
data = [[10, 8, 9, 5], [5, 7, 10, 7], [8, 8, 9, 6]]
# Column MultiIndex
columnIdx = pd.MultiIndex.from_tuples([('CS', 'CS101'), ('CS', 'CS102'), ('ST', 'CS103'), ('ST', 'CS104')])
columnIdx.names = ['Dept', 'Course']
# Row MultiIndex
rowIdx = pd.MultiIndex.from_tuples([('Postgrad', 'Bob'), ('Postgrad', 'Mary'), ('Undergrad', 'Anne')])
rowIdx.names = ['Level', 'Student']
# Create dataframe
df = pd.DataFrame(data, index = rowIdx, columns = columnIdx)
df

Dept                 CS          ST
Course            CS101 CS102 CS103 CS104
Level     Student
Postgrad  Bob        10     8     9     5
          Mary        5     7    10     7
Undergrad Anne        8     8     9     6

## Hierarchical Indexing

In [106]:
# Specify values for each row with Hierarchical Indexing
data = [[10, 8, 9, 5], [5, 7, 10, 7], [7, 6, 10, 6], [8, 8, 9, 6]]
# Column MultiIndex
columnIdx = pd.MultiIndex.from_tuples(
  [('CS', 'CS101'), ('CS', 'CS102'), ('ST', 'CS103'), 
   ('ST', 'CS104')], names = ['Dept', 'Course'])
# Row MultiIndex
rowIdx = pd.MultiIndex.from_tuples(
    [('Postgrad', 'Bob'), ('Undergrad', 'Will'), ('Postgrad', 'Mary'), 
     ('Undergrad', 'Anne')], names = ['Level', 'Student'])
# Create dataframe
df = pd.DataFrame(data, index = rowIdx, columns = columnIdx)
df = df.sort_index()
df

Dept                 CS          ST
Course            CS101 CS102 CS103 CS104
Level     Student
Postgrad  Bob        10     8     9     5
          Mary        7     6    10     6
Undergrad Anne        8     8     9     6
          Will        5     7    10     7

## DataFrame indexing

In [10]:
df = pd.DataFrame(np.random.randint(5, 10, (4, 5)), 
    index = pd.Index(['Bob', 'Mary', 'Joe', 'Will'], 
                     name='students'), 
    columns = pd.Index(['CS101', 'CS102', 'CS103', 'CS104', 'CS105'], 
                       name='courses'))
df

courses   CS101  CS102  CS103  CS104  CS105
students
Bob           5      6      8      7      9
Mary          6      7      8      8      8
Joe           7      9      5      7      7
Will          9      7      5      9      5

In [11]:
# Shorthand syntax for column selection
df[['CS102', 'CS105']]
# or df.loc[:, ['CS102', 'CS105']]

courses   CS102  CS105
students
Bob           6      9
Mary          7      8
Joe           9      7
Will          7      5

In [12]:
# Shorthand syntax for row selection
df[0:2]
# or df.iloc[0:2] or df.iloc[0:2, :]

courses   CS101  CS102  CS103  CS104  CS105
students
Bob           5      6      8      7      9
Mary          6      7      8      8      8

In [13]:
# Label-based indexing across two axes
df.loc[['Bob', 'Mary'], ['CS102', 'CS103']]

courses   CS102  CS103
students
Bob           6      8
Mary          7      8

In [14]:
# Integer-based indexing across two axes
df.iloc[0:1, :-1]

courses   CS101  CS102  CS103  CS104
students
Bob           5      6      8      7

In [15]:
# Label-based indexing across two axes
df.loc[['Bob', 'Mary'], ['CS102', 'CS105']]

courses   CS102  CS105
students
Bob           6      9
Mary          7      8

In [16]:
# Label-based indexing combined with boolean arrays
# columns CS101, CS102  for students with grade > 6 in CS101
df.loc[df.CS101 > 6, ['CS101', 'CS102']]

courses   CS101  CS102
students
Joe           7      9
Will          9      7

In [17]:
# Boolean Indexing, 
# students with average of columns CS104, CS105
# larger than 6
df[(df['CS105'] + df['CS104'])/2 > 6]

courses   CS101  CS102  CS103  CS104  CS105
students
Bob           5      6      8      7      9
Mary          6      7      8      8      8
Joe           7      9      5      7      7
Will          9      7      5      9      5

## DataFrame resizing

In [18]:
# Drop rows
newdf = df.drop(['Bob', 'Mary'], axis=0)
newdf
# or df.drop(index=['Bob', 'Mary'])

courses   CS101  CS102  CS103  CS104  CS105
students
Joe           7      9      5      7      7
Will          9      7      5      9      5

In [19]:
# Drop columns
newdf = df.drop('CS105', axis=1)
newdf
# or df.drop(columns=['CS105'])

courses   CS101  CS102  CS103  CS104
students
Bob           5      6      8      7
Mary          6      7      8      8
Joe           7      9      5      7
Will          9      7      5      9

In [20]:
# Create new column
df['Thesis'] = [9, 8, 9, 7]
df

courses   CS101  CS102  CS103  CS104  CS105  Thesis
students
Bob           5      6      8      7      9       9
Mary          6      7      8      8      8       8
Joe           7      9      5      7      7       9
Will          9      7      5      9      5       7

In [21]:
df1 = df.assign(CourseAvg = lambda row : row[0:5].mean(axis=1))
df2  = df1.assign(DiplomaGrade = df1.Thesis * 0.2 
                  + df1.CourseAvg * 0.8)
df2[['CourseAvg', 'DiplomaGrade']]

courses   CourseAvg  DiplomaGrade
students
Bob        7.333333      7.666667
Mary       7.500000      7.600000
Joe        7.333333      7.666667
Will       7.000000      7.000000

In [24]:
# Add columns CourseAvg and DiplomaGrade
df1 = df.assign(CourseAvg = lambda row : row.iloc[0:4].mean(axis=1))
df1 = df1.assign(DiplomaGrade = df1['Thesis'] * 0.2 + df1['CourseAvg'] * 0.8)
# Rename columns
df = df.rename(columns={'CourseAvg' : 'Course Avg', 
                   'DiplomaGrade': 'Diploma Grade'})

# Rename columns axis
df.columns.name = 'student report'
# Reset and move index to columns
df = df.reset_index()
df

student report students  CS101  CS102  CS103  CS104  CS105  Thesis
0                   Bob      5      6      8      7      9       9
1                  Mary      6      7      8      8      8       8
2                   Joe      7      9      5      7      7       9
3                  Will      9      7      5      9      5       7

In [107]:
# Select a slice based on a row subgroup
df.loc['Postgrad']

Dept       CS          ST
Course  CS101 CS102 CS103 CS104
Student
Bob        10     8     9     5
Mary        7     6    10     6

In [108]:
# Select a slice based on a column subgroup
df.loc[:, 'CS']

Course             CS101  CS102
Level     Student
Postgrad  Bob         10      8
          Mary         7      6
Undergrad Anne         8      8
          Will         5      7

In [109]:
# Select a row or column slice with an index tuple 
df.loc[:, ('CS', 'CS101')]

Level      Student
Postgrad   Bob        10
           Mary        7
Undergrad  Anne        8
           Will        5
Name: (CS, CS101), dtype: int64

In [110]:
# Select a slice based on an inner level label
idx = pd.IndexSlice
df.loc[idx[:, 'Bob'], 'CS']

Course            CS101  CS102
Level    Student
Postgrad Bob         10      8

## DataFrame Reshaping

### DataFrame Stack

In [28]:
data = [[10, 8, 9, 5], [5, 7, 10, 7], [7, 6, 10, 6], [8, 8, 9, 6]]

rowIdx = pd.MultiIndex.from_tuples(
    [('Postgrad', 'Bob'), ('Undergrad', 'Will'), ('Postgrad', 'Mary'), 
     ('Undergrad', 'Anne')], names = ['Level', 'Student'])

colIdx = pd.MultiIndex.from_tuples(
    [('CS101', 'Oral'), ('CS101', 'Written'), ('CS102', 'Oral'), 
     ('CS102', 'Written')], names = ['Course', 'Exam grade'])

df = pd.DataFrame(data, index = rowIdx, columns=colIdx)
df.sort_index()
df

Course            CS101         CS102
Exam grade         Oral Written  Oral Written
Level     Student
Postgrad  Bob        10       8     9       5
Undergrad Will        5       7    10       7
Postgrad  Mary        7       6    10       6
Undergrad Anne        8       8     9       6

In [31]:
# Move inner-most column level to the row
# hierarchical index
df.stack(future_stack=True)

Course                        CS101  CS102
Level     Student Exam grade
Postgrad  Bob     Oral           10      9
                  Written         8      5
Undergrad Will    Oral            5     10
                  Written         7      7
Postgrad  Mary    Oral            7     10
                  Written         6      6
Undergrad Anne    Oral            8      9
                  Written         8      6

### DataFrame unstack

In [48]:
df = pd.DataFrame(np.random.randint(5, 10, (4, 4)), 
    index = pd.Index(['Bob', 'Mary', 'Joe', 'Will'], 
                     name='students'), 
    columns = pd.Index(['CS101', 'CS102', 'CS103', 'CS104'], 
                       name='courses'))
df

courses   CS101  CS102  CS103  CS104
students
Bob           6      7      8      5
Mary          9      7      9      7
Joe           8      9      9      9
Will          9      8      7      6

In [36]:
series = df.unstack()
series

courses  students
CS101    Bob         8
         Mary        9
         Joe         6
         Will        9
CS102    Bob         7
         Mary        5
         Joe         8
         Will        6
CS103    Bob         9
         Mary        7
         Joe         7
         Will        5
CS104    Bob         7
         Mary        7
         Joe         8
         Will        6
dtype: int64

### DataFrame melt

In [72]:
df = pd.DataFrame(np.random.randint(5, 10, (4, 4)), 
    index = pd.Index(['Bob', 'Mary', 'Joe', 'Will'], 
                     name='Student'), 
    columns = pd.Index(['CS101', 'CS102', 'CS103', 'CS104'], 
                       name='Course'))
df = df.reset_index()
df

Course Student  CS101  CS102  CS103  CS104
0          Bob      6      5      6      9
1         Mary      9      6      9      7
2          Joe      6      6      7      6
3         Will      7      7      6      6

In [74]:
# Collapse CS* columns to a single column (Course)
# and their respective values to new column Grade
# students column is maintained as identifier variable
tidydf = df.melt(id_vars=['Student'], value_name='Grade')
tidydf.head()

  Student Course  Grade
0     Bob  CS101      6
1    Mary  CS101      9
2     Joe  CS101      6
3    Will  CS101      7
4     Bob  CS102      5

### DataFrame pivot

In [76]:
# Spread a values column across a new column index
tidydf.pivot(index='Student', columns = 'Course', values ='Grade')

Course   CS101  CS102  CS103  CS104
Student
Bob          6      5      6      9
Joe          6      6      7      6
Mary         9      6      9      7
Will         7      7      6      6

In [116]:
# Support for multi-level index
df = df.pivot_table(index=['Level', 'Student'], 
              columns = 'Course', values ='Grade')
df

Course             CS101  CS102  CS103  CS104
Level     Student
Postgrad  Bob       10.0    8.0    9.0    5.0
          Mary       7.0    6.0   10.0    6.0
Undergrad Anne       8.0    8.0    9.0    6.0
          Will       5.0    7.0   10.0    7.0

# Data aggregation

In [117]:
# Specify values for each row with Hierarchical Indexing
data = [[10, 8, 9, 5], [5, 7, 10, 7], [7, 6, 10, 6], [8, 8, 9, 6]]
# Column MultiIndex
columnIdx = pd.Index(
  ['CS101', 'CS102', 'CS103', 'CS104'], names = ['Dept', 'Course'])
# Row MultiIndex
rowIdx = pd.MultiIndex.from_tuples(
    [('Postgrad', 'Bob'), ('Undergrad', 'Will'), ('Postgrad', 'Mary'), 
     ('Undergrad', 'Anne')], names = ['Level', 'Student'])
# Create dataframe
df = pd.DataFrame(data, index = rowIdx, columns = columnIdx)
df = df.sort_index()
df

TypeError: Index.__new__() got an unexpected keyword argument 'names'

In [ ]:
# Calculate statistics for a specific column
df.loc[:, ('CS', 'CS101')].describe()

In [ ]:
# Individual aggregate function for all columns
df.mean()

In [ ]:
# Multiple aggregation functions for all columns
df.agg(['mean', 'max', 'min'])

## Group operations

In [ ]:
df

In [ ]:
# Group per level of studies
# Iterate over groups
groups = df.groupby(by='Level')
for name, group in groups:
    print(name)
    print(group)

In [ ]:
# Compute mean and max for each course per level
groups.agg(['mean', 'max'])

# Plotting with matplotlib

In [ ]:
data = df.groupby(by='Level').mean()
data

In [ ]:
import matplotlib.pyplot as plt
# Create a figure
fig = plt.figure()
# Add a subplot to the figure
ax1 = fig.add_subplot(1, 2, 1)
# Configure plot
ax1.set_title('Average Course Grade per Student Level')
ax1.set_ylabel('Grade')
ax1.set_xlabel('test')
# Visualize the dataframe as a bar plot 
data.plot.bar(ax=ax1, figsize=(10, 5))
# Add a second subplot to the figure
ax2 = fig.add_subplot(1, 2, 2)
# Visualize another dataframe inside the second plot
df.loc[('Postgrad', 'Bob')].plot.bar(ax=ax2, figsize=(10, 5))